Unplace Method
 Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void Unplace()
  Visual Basic
Public Sub Unplace
  Visual C++
public:
void Unplace()
 Remarks
 Note that current room is changed to unplaced and all corresponding rooms which in other group instance are deleted when in group edit mode.
 See Also
  Room Class
  Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →